'''
Подвиг 7.
Вводятся номера телефонов в одну строчку через пробел с разными кодами стран:
 +7, +6, +2, +4 и т.д. Необходимо составить словарь d, где ключи - это коды +7, +6, +2 и т.п.,
а значения - список номеров (следующих в том же порядке, что и во входной строке) с соответствующими кодами.
Полученный словарь вывести командой:
print(*sorted(d.items()))
Sample Input:
+71234567890 +71234567854 +61234576890 +52134567890 +21235777890 +21234567110 +71232267890
Sample Output:
('+2', ['+21235777890', '+21234567110']) ('+5', ['+52134567890']) ('+6', ['+61234576890']) ('+7', ['+71234567890', '+71234567854', '+71232267890'])
'''

test_str = '+71234567890 +71234567854 +61234576890 +52134567890 +21235777890 +21234567110 +71232267890'
lst_in = test_str.split()
lst_in.sort()
print(lst_in)
d = {}
for i in range(len(lst_in)):
    d[lst_in[i][0:2:1]] = []
d_key = list(d)
for j in range(len(d)):
    for k in range(len(lst_in)):
        if d_key[j] == lst_in[k][0:2:1]:
            d[d_key[j]].append(lst_in[k])
            print(type(d))
print(d)
