'''
Подвиг 4.
Имеется закодированная строка с помощью азбуки Морзе.
Коды разделены между собой пробелом. Необходимо ее раскодировать,
используя азбуку Морзе из предыдущего занятия. Полученное сообщение (строку) вывести на экран.
Sample Input:
.-- ... . -...- .-- . .-. -. ---
Sample Output:
все верно
'''
d = {'а': '.-', 'б': '-...', 'в': '.--', 'г': '--.', 'д': '-..', 'е': '.',
     'ж': '...-', 'з': '--..', 'и': '..', 'й': '.---', 'к': '-.-',
     'л': '.-..', 'м': '--', 'н': '-.', 'о': '---', 'п': '.--.', 'р': '.-.',
     'с': '...', 'т': '-', 'у': '..-', 'ф': '..-.', 'х': '....', 'ц': '-.-.',
     'ч': '---.', 'ш': '----', 'щ': '--.-', 'ъ': '--.--', 'ы': '-.--',
     'ь': '-..-', 'э': '..-..', 'ю': '..--', 'я': '.-.-', ' ': '-...-'}
rd = dict.fromkeys(d.values())
for k in d:
    rd[d[k]] = k
lst_in = input().split()
de_str = ''
for e in lst_in:
    de_str = de_str + rd[e]
print(de_str, end='')
